Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Like Twig’s core date filter, but with additional support for the following format values:
ja: Twig の date フィルタと同様ですが、次の format 値を追加サポートしています。

source: Like Twig’s core json_encode filter, but if the options argument isn’t set, it will default to JSON_HEX_TAG | JSON_HEX_AMP | JSON_HEX_QUOT if the response content type is either text/html or application/xhtml+xml.
ja: Twig の json_encode フィルタと同様ですが、引数 options がセットされておらず、レスポンスのコンテンツタイプが text/html または application/xhtml+xml の場合、デフォルトで JSON_HEX_TAG | JSON_HEX_AMP | JSON_HEX_QUOT になります。

source: Like the `date` filter, but the result will also include a timestamp.
ja: `date` フィルタと同様ですが、結果にはタイムスタンプも含まれます。

source: Like the `time` filter, but for times rather than dates.
ja: `time` フィルタと同様ですが、日付よりも時間のためのものです。

source: Like the date filter, but the result will also include a timestamp.
ja: date フィルタと同様ですが、結果にはタイムスタンプも含まれます。

source: Like the time filter, but for times rather than dates.
ja: time フィルタと同様ですが、日付よりも時間のためのものです。

source: Like the technical community as a whole, the Craft team and community is made up of a mixture of professionals and volunteers from all over the world, working on every aspect of the mission - including mentorship, teaching, and connecting people.
ja: すべての技術的なコミュニティがそうであるように、Craft チームとコミュニティも世界中のプロフェッショナルとボランティアの混成で成り立ち、指導者・教育者・さらに繋がる人々を含め、あらゆるミッションに取り組んでいます。

source: Likewise, when you deselect a category from within the main field input, any of its descendants will also become deselected.
ja: 同様に、メインフィールドの入力からカテゴリを選択解除すると、そのすべての子孫カテゴリも選択解除されます。

source: Limit – The maximum number of assets that can be related with the field at once.
ja: リミット – フィールドに関連付けできるアセット数の上限

source: Limit – The maximum number of categories that can be related with the field at once.
ja: ブランチ制限 – フィールドと一度に関連付けできるカテゴリ数の上限

source: Limit – The maximum number of entries that can be related with the field at once.
ja: リミット – フィールドと一度に関連付けできるエントリ数の上限

source: Limit – The maximum number of users that can be related with the field at once.
ja: リミット – フィールドと一度に関連付けできるユーザー数の上限

source: Loading your plugin into a Craft project
ja: Craft プロジェクトへのプラグインの読み込み

source: Local Environments
ja: ローカル環境

source: Local volumes have two important settings:
ja: ローカルボリュームには、2つの重要な設定があります。

source: Local volumes’ File System Path settings
ja: ローカルボリュームのファイルシステムパス設定

source: Locales
ja: ロケール

source: Localization
ja: ローカライゼーション

source: Logging
ja: ロギング

source: Logic Tags
ja: ロジックタグ

source: Logic tags control what happens in your template.
ja: ロジックタグは、テンプレート内で起きることをコントロールします。

source: Logic tags don't output anything to the template on their own.
ja: ロジックタグは、それ自身でテンプレートに何も出力しません。

source: Login Form
ja: ログインフォーム

source: Look for:
ja: 次のコメントを探してください。

source: Lowercases the first character of a string.
ja: 文字列の最初の文字を小文字にします。

source: Macros
ja: マクロ

source: Mailer Component
ja: Mailer コンポーネント

source: Make other users Admins (Craft Pro only)
ja: 他のユーザーを管理者にする（Craft Pro のみ）

source: Make required
ja: 必須にする

source: Manipulating Database Data
ja: データベースデータの操作

source: Matrix Block
ja: 行列ブロック

source: Matrix Block Query Params
ja: 行列ブロックのクエリパラメータ

source: Matrix Fields
ja: 行列フィールド

source: Matrix blocks
ja: 行列ブロック

source: Matrix fields allow you to create multiple blocks of content within a single field.
ja: 行列フィールドでは、1つのフィールド内に複数のコンテンツブロックを作成できます。

source: Matrix fields have the following settings:
ja: 行列フィールドの設定は、次の通りです。

source: Matrix
ja: 行列

source: MatrixBlock
ja: 行列ブロック

source: Max Blocks – The maximum number of blocks that can be created within the field.
ja: 最大ブロック数 – フィールドに作成できるブロック数の上限

source: Max Length – The maximum number of characters the field can contain
ja: 文字数制限 – フィールドに含めることができる文字数の上限

source: Max Value – The highest number that may be entered in the field.
ja: 最大値 – フィールドに入力できる最大の数字

source: Maximum number of levels you can nest categories in the group
ja: そのグループの中にネストできるカテゴリの最大レベル

source: Maximum number of records to be returned
ja: 返されるレコードの最大数

source: Members of the Craft community should be respectful when dealing with other members as well as with people outside the Craft community.
ja: Craft コミュニティのメンバーは、コミュニティ外の人々と同様、他のメンバーとのやりとりに敬意を表するべきです。

source: Min Value – The lowest number that may be entered in the field
ja: 最小値 – フィールドに入力できる最小の数字

source: Mobile
ja: モバイル

source: Mode can be set to the following values:
ja: モード には、次の値をセットできます。

source: Mode – the transform mode
ja: モード – 変換モード

source: Models
ja: モデル

source: More Information
ja: 詳細情報

source: Most likely you forgot to set the correct DB_TABLE_PREFIX.
ja: 多くの場合、正しい DB_TABLE_PREFIX を設定するのを忘れています。

source: Most parameter values will get processed through before being applied as a condition on the element query.
ja: ほんとんどのパラメータ値は、エレメントクエリの条件として適用される前に、 を通して処理されます。

source: Most parameter values will get processed through craft\helpers\Db::parseParam() before being applied as a condition on the element query.
ja: ほんとんどのパラメータ値は、エレメントクエリの条件として適用される前に、craft\helpers\Db::parseParam() を通して処理されます。

source: Most sections of the documentation have detailed examples of how to use the concept we're covering.
ja: ドキュメントの大抵のセクションは、わたしたちがカバーする概念をどのように使うかの例を詳述してあります。

source: Move files to a different folder (via drag and drop)
ja: （ドラッグアンドドロップによる）別フォルダへのファイルの移動

source: Move subfolders
ja: サブフォルダの移動

source: Move the storage/userphotos/ folder somewhere below your web root (e.g. public_html/userphotos/)
ja: storage/userphotos/ フォルダをウェブルート下層のどこかに移動します。（例： public_html/userphotos/）

source: Move the storage/userphotos/ folder somewhere below your web root (e.g. web/userphotos/)
ja: storage/userphotos/ フォルダをウェブルート下層のどこかに移動します。（例：web/userphotos/）

source: Moving to the new structure is generally recommended, for a couple reasons:
ja: いくつかの理由から、新しい構造への移行が一般的に推奨されています。

source: Multi-select Fields
ja: マルチセレクトボックスフィールド

source: Multi-select Options – Define the options that will be available in the field.
ja: マルチセレクトボックスのオプション – フィールドで利用可能なオプションを定義します。

source: Multi-select fields give you a multi-select input.
ja: マルチセレクトボックスフィールドは、複数選択形式の入力を提供します。

source: Multi-select fields have the following settings:
ja: マルチセレクトボックスフィールドの設定は、次の通りです。

source: Multi-select fields will show a multi-select input with each of the Multi-select Options as defined in the field settings:
ja: マルチセレクトボックスフィールドでは、フィールド設定で定義されたマルチセレクトボックスのオプションが複数選択形式で表示されます。

source: Multi-select
ja: マルチセレクトボックス

source: MySQL 5.5+ (with InnoDB) or PostgreSQL 9.5+
ja: MySQL 5.5 以降（with InnoDB）または PostgreSQL 9.5 以降

source: Name
ja: 名前

source: Name – the transform’s user-facing name
ja: 名前 – ユーザーに対する画像変形の名前

source: Name – The entry type’s name
ja: 名前 – 入力タイプの名前

source: Named parameters in the pattern should be defined using the format (<ParamName:RegExp>) rather than as a regular expression subpattern ((?PRegExp)).
ja: パターンの名前付けされたパラメータは、正規表現のサブパターン（(?PRegExp)）ではなく、フォーマット（<ParamName:RegExp>）を使用して定義する必要があります。

source: Namespace prefix – Your plugin’s class namespaces will begin with this.
ja: 名前空間接頭辞 – あなたのプラグインのクラス名前空間は、これで始まります。

source: Naming things is one of the in computer science, so if you can make a decision on those things, the rest of the plugin should practically write itself.
ja: 名前を決めることは、コンピュータサイエンスの中で の1つです。それを決めることさえできれば、あとは実際にプラグインの内容を書くだけです。

source: Navigation examples
ja: ナビゲーションの実例

source: Nearby Page Links
ja: 近くのページリンク

source: New
ja: 新

source: New Param
ja: 新パラメータ

source: New Property
ja: 新プロパティ

source: New Setting
ja: 新設定

source: New Token
ja: 新トークン

source: Next up you need to type “as”, followed by one or two variable names:
ja: 次に「as」の記述が必要で、その後に1つまたは2つの変数名が続きます。

source: Next up, you need to create a database for your Craft project.
ja: 次に、Craft プロジェクト向けのデータベースを作成する必要があります。

source: Next you need to type the word “in”, followed by the array of entries the tag should loop through.
ja: 次に「in」という単語の記述が必要で、その後にタグがループ処理するエントリの配列が続きます。

source: No comments
ja: コメントは使えません

source: Normal Twig tags are supported as well, in case you want to include {% if %} conditionals in your path, or access other objects besides the source element, such as {{ now|date('Y-m-d') }} or {{ currentUser.username }}.
ja: 通常の Twig タグもサポートされています。パスに条件文 {% if %} を含めたり、{{ now|date('Y-m-d') }} や {{ currentUser.username }} のようなソースエレメント以外のオブジェクトにもアクセスできます。

source: Not all sections are created equal.
ja: すべてのセクションが同じように作成されるわけではありません。

source: Not in charge of the server?
ja: サーバー担当ではありませんか？

source: Not working?
ja: 動きませんか？

source: Note how in that example there are no quotes around “thumb”, like there were in the first one.
ja: ここでは、最初の例のように「thumb」の周りに引用符がないことに注意してください。

source: Note that n is 0-indexed, so nth(0) will give you the first element, nth(1) will give you the second, etc.
ja: n は 0 からはじまるため、nth(0) は最初のエレメントを nth(1) は2番目のエレメントを取得する点に注意してください。

source: Note that Craft will automatically redirect users to your homepage after going here; there’s no such thing as a “logout page”.
ja: ここに遷移した後、Craft はユーザーをホームページへ自動的にリダイレクトします。「ログアウト ページ 」といったものはありません。

source: Note that Craft/PHP must be able to write to the directory you created.
ja: Craft もしくは PHP が、作成したディレクトリに書き込み可能でなければならないことに注意してください。

source: Note that at the end of this, your “project root” (as referenced in other areas of the documentation) will be your craft/ directory, not its parent directory.
ja: この最後にある（他の領域のドキュメント内で参照されている）"プロジェクトルート"は craft/ ディレクトリであり、その親ディレクトリではないことに注目してください。

source: Note that each transform definition you want to eager-load can either be a string (the handle of a transform defined in Settings → Assets → Image Transforms) or an object that defines the transform properties.
ja: eager-load したいそれぞれのトランスフォームの定義は、文字列（「設定 > アセット > 画像の変形」で定義されたトランスフォームのハンドル)、 または、トランスフォームプロパティを定義したオブジェクトのいずれかです。

source: Note that if you are creating the Assets field within a Matrix field, the source element is going to be the actual Matrix block, not the element that the Matrix field is being created on.
ja: 行列フィールドの中でアセットフィールドを作成する場合、ソースエレメントは作成された行列フィールドのエレメント ではなく、実際の行列ブロックになります。

source: Note that the shortcut syntax only has one set of curly braces.
ja: ショートカット構文には、中括弧が1つしかないことに注意してください。

source: Note that these examples use Craft 2’s default tablePrefix DB config setting of craft.
ja: この例では、Craft 2 デフォルトの craft を DB コンフィグ設定の tablePrefix に設定している点に注意してください。

source: Note that these examples use the default craft/config/db.php config setting of craft.
ja: これらの例では、craftのコンフィグ設定にデフォルトの craft/config/db.php を使用している点に注意してください。

source: Note that this icon cannot contain strokes, and will always be displayed in a solid color (respecting alpha transparency).
ja: このアイコンにはストロークを含めることができず、常に（アルファ透明度に関して）ソリッドカラーで表示されることに注意してください。

source: Note that we’re wrapping those links in conditionals because there won’t always be a previous or next page.
ja: 前、または、次のページが常に存在するとは限らないため、これらのリンクを条件文でラップしていることに注意してください。

source: Note:
ja: メモ：

source: Note: Craft’s Control Panel browser requirements have nothing to do with your actual website.
ja: メモ：Craft の CP のブラウザ要件は、実際のウェブサイトとは関係がありません。

source: Note: If Composer complains that your system doesn’t have PHP 7 installed, but you know it’s not an issue because Craft will run with a different PHP install (e.g. through MAMP or Vagrant), use the --ignore-platform-reqs flag.
ja: メモ：システムに PHP 7 がインストールされていないと Composer が不満を言うかもしれません。しかし、別途インストールされた PHP（例えば MAMP や Vagrant）上で Craft を実行するつもりで、問題ないと判っているのであれば --ignore-platform-reqs フラグを使ってください。

source: Note: If your craft/ directory lives in a public directory on your server (e.g. within public_html/), you will need to make sure the new craft/vendor/ directory is protected from web traffic.
ja: メモ：craft/ ディレクトリがサーバーの公開ディレクトリ（例：public_html/ 内）にある場合、新しい craft/vendor/ ディレクトリがウェブトラフィックから保護されるよう確認する必要があります。

source: Note: Your URI should not begin with a slash (/).
ja: メモ：URI はスラッシュ（/）ではじめるべきではありません。

source: Note: if any of the URI segments begin with an underscore (_), Craft will return a 404.
ja: メモ：URL セグメントがアンダースコア（_）ではじまる場合、Craft は 404 を返します。

source: Nothing that Craft couldn’t live without, if the folder happened to get deleted.
ja: もしフォルダが削除されたとしても、Craft の稼働に影響はありません。

source: Now Craft will run the installer and complete the setup process.
ja: これで Craft はインストーラーを実行し、セットアッププロセスを完了できるようになりました。

source: Now any time you call a parameter-setter method, the method will:
ja: 今では、パラメータ設定メソッドを呼び出すときは、次のような手順になります。

source: Now build something incredible.
ja: さぁ、素晴らしいものを築きあげましょう。

source: Now get back to work.
ja: 今すぐ仕事に戻ってください。

source: Now that you have successfully upgraded your Craft 2 project to Craft 3, please take some time to review the changes in Craft 3.
ja: これで Craft 2 プロジェクトから Craft 3 へのアップグレードが完了しました。Craft 3 の変更点を確認する時間を設けてください。

source: Now we can assign the ingredients to each Drink entry via the new Ingredients relation field.
ja: これで、それぞれのドリンクエントリに新しい「原材料」フィールドから原材料を割り当てることができます。

source: Now we need to create the fields to hold our content within that Section.
ja: 今度は、そのセクション内にコンテンツを保持するため、フィールドを作る必要があります。

source: Now when we try to access http://mysite.com/recipes/entry Craft returns a 404 error instead of attempting to render the template.
ja: これで http://mysite.com/recipes/entry にアクセスすると、Craft がテンプレートのレンダリングを試みる代わりに、404 エラーを返します。

source: Now within your translations/ folder, you should create subdirectories for each locale, and within them, PHP files for each translation category.
ja: translations/ フォルダの中にローケルごとのサブディレクトリを作成し、それぞれに翻訳カテゴリごとの PHP ファイルを作成する必要があります。

source: Number Fields
ja: 数字フィールド

source: Number fields give you a text input that accepts a numeric value.
ja: 数字フィールドでは、数値を受け入れるテキスト入力を提供します。

source: Number fields have the following settings:
ja: 数字フィールドの設定は、次の通りです。

source: Number fields will show a text box where you can enter a number:
ja: 数字フィールドでは、数字を入力できるテキストボックスを表示します。

source: Number
ja: 数字

source: Old
ja: 旧

source: Old Param
ja: 旧パラメータ

source: Old Property
ja: 旧プロパティ

source: Old Setting
ja: 旧設定

source: Old Token
ja: 旧トークン

source: On a fresh entry, Matrix fields will just show a group of buttons – one for each of the Block Types you created in the field’s settings.
ja: 新しいエントリでは、行列フィールドにはボタンのグループが表示されます。フィールド設定で作成したブロックタイプごとに1つのボタンが表示されます。

source: Once Craft’s files are in place, your project directory should have a file structure like this:
ja: Craft のファイルが適切な場所にあれば、プロジェクトディレクトリは次のようなファイル構造になっているはずです。

source: Once a field is selected, a gear icon will appear beside it.
ja: フィールドが選択されると、歯車アイコンが横に表示されます。

source: Once all the files are in place, open your public/index.php file, find this line:
ja: すべてのファイルがあるべき場所に配置されたら、public/index.php ファイルを開き、次の行を探してください。

source: Once it’s done you will be shown a success message:
ja: 完了すると、成功メッセージが表示されます。

source: Once it’s done, you should be able to access your new Craft site from your web browser.
ja: それが終われば、ウェブブラウザから新しい Craft サイトにアクセスできるはずです。

source: Once it’s finished, your project directory should have a file structure like this:
ja: インストールが終わったとき、プロジェクトディレクトリは以下のようなファイル構成になっているべきです。

source: Once we have our relations field set up, we can look at the options for outputting related elements in our templates.
ja: リレーションフィールドをセットアップすると、テンプレート内で関連するエレメントを出力するためのオプションを見ることができます。

source: Once you create the database, you’ll need to configure your .env file with
ja: データベースを作成したら、 .env ファイルに設定する必要があります。

source: Once you create the database, you’ll need to configure your .env file with the database connection settings.
ja: データベースを作成したら、データベースの接続設定を .env ファイルに設定する必要があるでしょう。

source: Once you set up your site to allow public user registration, the last step is to create a user registration form on your site’s front end.
ja: サイトに一般ユーザーの登録を許可する設定を行ったら、最後のステップとしてフロントエンドにユーザー登録フォームを作成します。

source: Once you've completed everything listed above you can continue with the upgrade process.
ja: 上記リストをすべて満たしているなら、アップグレードプロセスを続行できます。

source: Once you've completed the setup process you can right to the control panel to log in.
ja: セットアッププロセスが完了すると、コントロールパネルにログインできるようになります。

source: Once your asset volume has some fields associated with it, you can edit the fields’ content by double-clicking on your assets, either from within the Assets index, or within an Assets field.
ja: アセットボリュームにフィールドが関連付けられると、アセットのインデックスだけでなくアセットフィールド内にあるアセットをダブルクリックすることで、フィールドのコンテンツを編集できます。

source: Once you’ve created an element query, you can set parameters on it.
ja: 作成したエレメントクエリには、パラメータをセットすることができます。

source: Once you’ve created your fields, you can get it to show up in your edit forms by adding them to a “field layouts”.
ja: フィールドを作成すると、「フィールドレイアウト」にそれらを加えることによって編集フォームに表示させることができます。

source: Once you’ve defined your parameters on the query, there are multiple methods available to execute it, depending on the data you need back.
ja: クエリにパラメータを定義したら、必要とするデータに応じて、それを実行するために利用可能な複数のメソッドがあります。

source: Only activates the {% cache %} tag if a certain condition is met.
ja: ある条件が満足される場合のみ、 {% cache %} タグを作動させます。

source: Only do it if you trust that they know what they’re doing.
ja: 彼（彼女）らが自分が実行することの意味を理解できていると確信できる場合のみに留めてください。

source: Open your terminal and go to the craft/ directory:
ja: ターミナルを開き craft/ ディレクトリに移動してください。

source: Optional PHP Extensions
ja: オプションの PHP エクステンション

source: Or as a way to automatically include the proper template for each language:
ja: あるいは、言語ごとの固有なテンプレートを自動的に含む方法もあります。

source: Or you can loop through all of the available options rather than just the selected one:
ja: または、選択されたものだけでなく、利用可能なすべてのオプションをループすることもできます。

source: Or you can loop through all of the available options rather than just the selected ones:
ja: または、選択されたものだけでなく、利用可能なすべてのオプションをループすることもできます。

source: Or you can replace one thing at a time:
ja: または、一度に1つのものを置き換えることができます。

source: Ordering results by score
ja: スコアによる検索結果の順位付け

source: Otherwise, the values are always copied across all sites.
ja: さもなければ、すべてのサイトに常に同一の値がコピーされます。

source: Our recipes are pretty simple but we do need to define some Fields:
ja: レシピはとてもシンプルながら、いくつかのフィールド定義が必要です。

source: Output Tags
ja: 出力タグ

source: Output tags are only for outputting to the template, so you never place output tags within statement tags in Twig.
ja: 出力タグはテンプレートにアプトプットするためのものなので、 Twig の命令タグ内に記述することは絶対にできません

source: Output tags are responsible for printing things out to the rendered HTML.
ja: 出力タグは、レンダリングされた HTML にプリントする責任があります。

source: Outputs a date in the ISO-8601 format (which should be used for Atom feeds, among other things).
ja: （とりわけ、Atom フィードで使用される）ISO-8601 形式の日付を出力します。

source: Outputs a date in the format required for RSS feeds (D, d M Y H:i:s O).
ja: RSS フィードに必要な形式（D, d M Y H:i:s O）で日付を出力します。

source: Outputs any scripts and styles that were registered for the “begin body” position.
ja: 「begin body」に登録されたスクリプトやスタイルを出力します。

source: Outputs any scripts and styles that were registered for the “end body” position.
ja: 「end body」に登録されたスクリプトやスタイルを出力します。

source: Outputs any scripts and styles that were registered for the “head” position.
ja: 「head」に登録されたスクリプトやスタイルを出力します。

source: Overriding Volume Settings
ja: ボリューム設定の上書き

source: PDO MySQL Driver or PDO PostgreSQL Driver
ja: PDO MySQL Driver または PDO PostgreSQL Driver

source: PHP 7.0+
ja: PHP 7.0 以降

source: PHP Constants
ja: PHP 定数

source: PHP code isn’t allowed in your templates.
ja: テンプレート内で PHP コードは使用できません。

source: PHP scripts can validate the value via CSecurityManager::validateData:
ja: PHP スクリプトは、CSecurityManager::validateData を経由して値を検証できます。

source: PHP scripts can validate the value via Security::validateData():
ja: PHP スクリプトは、Security::validateData() を経由して値を検証できます。

source: Package name – Used to name your Composer package.
ja: パッケージ名 – Composer パッケージに名前をつけるために利用されます。

source: Paginated URLs will be identical to the first page’s URL, except that “/p_X_” will be appended to the end (where X is the page number), e.g. http://example.com/news/p2.
ja: ページ付けされた URL は最初のページ URL と同一になりますが、最後に「/p_X_」（X はページ番号）が追加されます。例：http://example.com/news/p2.

source: Param
ja: パラメータ

source: Param Value Syntax
ja: パラメータ値の構文

source: Parameters
ja: パラメータ

source: Parses a string for reference tags.
ja: リファレンスタグの文字列を解析します。

source: Parsing Reference Tags
ja: リファレンスタグの解析

source: Passes a string through Craft::getAlias(), which will check if the string begins with an alias.
ja: その文字列がエイリアスではじまるかをチェックする Craft::getAlias() に、文字列を渡します。

source: Passing Multiple Relation Criteria
ja: 複数のリレーションの判定基準を渡す

source: Paste your security key inside the quotes and save the file.
ja: ダブルクォートの内側にセキュリティキーをペーストし、ファイルを保存します。

source: Performing the Upgrade
ja: アップグレードの実行

source: Permission
ja: 権限

source: Permissions
ja: 権限

source: Personal insults, especially those using racist or sexist terms.
ja: 個人的な侮辱。とりわけ、人種差別的であったり性差別的な表現を用いるもの。

source: Placeholder Text – The field’s placeholder text, to be displayed if the field has no value yet
ja: プレースホルダーのテキスト – フィールドが値を持たない場合に表示されるプレースホルダーのテキスト

source: Plain Text Fields
ja: プレーンテキストフィールド

source: Plain Text fields give you either a normal text input or a multi-line textarea, where plain text can be entered.
ja: プレーンテキストフィールドでは、プレーンなテキストを入力できる、一行テキストまたは複数行のテキストエリアのいずれかが提供されます。

source: Plain Text fields have the following settings:
ja: プレーンテキストフィールドの設定は、次の通りです。

source: Plain Text fields will either show a normal text input or a multi-line textarea, depending on whether the “Allow line breaks” setting was checked.
ja: プレーンテキストフィールドでは、設定の「改行を許可」がチェックされているかどうかによって、一行テキストまたは複数行のテキストエリアのいずれかが表示されます。

source: Plain Text
ja: プレーンテキスト

source: Please consult a specialist before trying {% cache %}.
ja: {% cache %} を試す前に、専門家に相談してください。

source: Plugin Development
ja: プラグイン開発

source: Plugin Icons
ja: プラグインアイコン

source: Plugin Migrations
ja: プラグインマイグレーション

source: Plugin Name with your plugin name.
ja: Plugin Name をプラグイン名にします。

source: Plugin Settings
ja: プラグイン設定

source: Plugin handle – Something that uniquely identifies your plugin within the Craft ecosystem.
ja: プラグインハンドル – Craft のエコシステム内でプラグインを一意に識別する何か。

source: Plugin icons must be square SVG files, saved as icon.svg at the root of your plugin’s source directory (e.g src/).
ja: プラグインアイコンは、プラグインのソースディレクトリ（例：src/）のルートに icon.svg として保存された、正方形の SVG ファイルでなければいけません。

source: Plugin name – What your plugin will be called within the Control Panel.
ja: プラグイン名 – コントロールパネル内でプラグインを何と呼ぶか。

source: Plugins
ja: プラグイン

source: Plugins are mini applications that run alongside Craft’s core code.
ja: プラグインは、Craft のコアコードと一緒に動作する小さなアプリケーションです。

source: Plugins can be installed and uninstalled.
ja: プラグインのインストール、アンインストールが可能です。

source: Plugins can have their own migration track.
ja: プラグインは独自のマイグレーショントラックを持つことができます。

source: Plugins can provide an icon, which will be visible on the Settings → Plugins page.
ja: プラグインは「設定 > プラグイン」ページに表示されるアイコンを提供できます。

source: Plugins’ translation messages
ja: プラグイン向けの翻訳メッセージ

source: Point your browser to your Control Panel URL (e.g. http://example.dev/admin).
ja: ブラウザでコントロールパネルの URL（例：http://example.dev/admin）にアクセスします。

source: Position
ja: 位置

source: Position Select Fields
ja: 位置選択フィールド

source: Possible Values
ja: 利用可能な値

source: Possible side effects include stale content, excessively long-running background tasks, stuck tasks, and in rare cases, death.
ja: 可能性のある副作用には、古くなったコンテンツ、過度に時間のかかるバックグラウンドタスク、動かなくなったタスク、および稀に消滅があります。

source: Posting (or threatening to post) other people’s personally identifying information ("doxing").
ja: 他の人の身元を明らかにする情報の投稿、または、投稿すると脅すこと（「晒し」行為）。

source: Posting sexually explicit or violent material.
ja: 性的に露骨な、または、暴力的な資料の投稿。

source: Prefixes the given string with a keyed-hash message authentication code (HMAC), for securely passing data in forms that should not be tampered with.
ja: 不正に変更されるべきではないフォームのデータを安全に渡すために、メッセージ認証コード（HMAC）の鍵付ハッシュを指定された文字列の先頭に追加します。

source: Preparation
ja: 準備

source: Preparing for the Upgrade
ja: アップグレードのための準備
